[
    {
        "id": 1,
        "title": "Cocktail Memory Game",
        "description": "This is a memory game created using React. When the user arrives on the page they are presented with a random grid of different cocktails to pick from. When they click on a new cocktail, the score increases and the grid randomly reshuffles. If the user clicks the same cocktail twice, they are told they guessed incorrectly and the game reloads but the high score persists.",
        "image": "https://github.com/RyanKirkland86/react-portfolio/tree/main/react-portfolio/public/img/Portfolio/CocktailMemoryGame.png",
        "github": "https://github.com/RyanKirkland86/react-memory-game",
        "website": "https://ryankirkland86.github.io/react-memory-game/"
    },
    {
        "id": 2,
        "title": "Employee Directory",
        "description": "This is an employee directory created using React. The user can view their entire employee directory at once to have quick access to their information, such as name, email, phone number, date of birth, and an included image thumbnail. The user may enter name into search field and may click on the name header in the table to sort alphabetically.",
        "image": "https://github.com/RyanKirkland86/react-portfolio/tree/main/react-portfolio/public/img/Portfolio/EmployeeDirectory.png",
        "github": "https://github.com/RyanKirkland86/employee-directory",
        "website": "https://ryankirkland86.github.io/employee-directory/"
    },
    {
        "id": 3,
        "title": "Workout Tracker",
        "description": "This is a NoSQL project using MongoDB and Mongoose that allows for a user to view, create, and track daily workouts. The user may log multiple exercises in a workout on a given day and are able to track the name, type, weight, sets, reps, and duration of exercise. If the exercise is a cardio exercise, they are able to track the distance traveled.",
        "image": "https://github.com/RyanKirkland86/react-portfolio/tree/main/react-portfolio/public/img/Portfolio/WorkoutTracker.png",
        "github": "https://github.com/RyanKirkland86/workout-tracker",
        "website": "https://ryansworkouttracker.herokuapp.com/"
    },
    {
        "id": 4,
        "title": "My Job",
        "description": "This is a full stack web application that empowers a user to better organize their job search. The user can create a unique profile, add job applications, track their status, update with notes, and compare data.",
        "image": "https://github.com/RyanKirkland86/react-portfolio/tree/main/react-portfolio/public/img/Portfolio/MyJobLandingPage.png",
        "github": "https://github.com/RyanKirkland86/my-job",
        "website": "https://fathomless-atoll-85765.herokuapp.com/"
    },
    {
        "id": 5,
        "title": "AIO Developer Webpage",
        "description": "An all-in-one homepage that keeps window management to a minimum. Site includes commonly used reference links, live weather forecasting by location, a note taking section that can save notes to local storage, top tech news in a Bootstrap carousel, an inspiring quote of the day, a random joke to make you smile, quick random GIF search by topic, and a YouTube link to a playlist of relevant videos.",
        "image": "https://github.com/RyanKirkland86/react-portfolio/tree/main/react-portfolio/public/img/Portfolio/DevHompageLanding.png",
        "github": "https://github.com/michaelanthonyyy/aio-developer-homepage",
        "website": "https://michaelanthonyyy.github.io/aio-developer-homepage/"
    },
    {
        "id": 6,
        "title": "Password Generator",
        "description": "This is a password generator that anyone can use to generate a unique, random, and secure password based on criteria they’ve selected. This app will run in the browser, and features dynamically updated HTML and CSS powered by JavaScript. It has a clean and polished user interface that is responsive, ensuring that it adapts to multiple screen sizes.",
        "image": "https://github.com/RyanKirkland86/react-portfolio/tree/main/react-portfolio/public/img/Portfolio/PasswordGeneratorExample.jpg",
        "github": "https://github.com/RyanKirkland86/password-generator",
        "website": "https://ryankirkland86.github.io/password-generator/"
    }
]